read_verilog controller.v 
proc; opt
fsm; opt
memory; opt
techmap; opt
write_verilog controller_synth.v
